test/php/CartApiBundle/Domain/CartApi/Commercetools/_fixtures/paymentFixture.json

{
    "key": "111",
    "interfaceId": "7ba6efec-da46-4b06-98c0-412feb9180dd",
    "paymentMethodInfo": {
        "paymentInterface": "paypal",
        "method": "paypal"
    },
    "amountPlanned": {
        "centAmount": 10000,
        "currencyCode": "EUR"
    },
    "paymentStatus": {
        "interfaceCode": "paid"
    },
    "version": 1
}

